In [1]:
import pandas as pd
import numpy as np

In [2]:
#create a Series with the help of numpy 1D array 
#First create a 1D numpy array
A=np.array([45,67,89,76,43,23,78])
print(type(A))
print(A)

<class 'numpy.ndarray'>
[45 67 89 76 43 23 78]

In [3]:
#converts numpy 1D array A into Series 
S=pd.Series(A)
print(type(S))

<class 'pandas.core.series.Series'>

In [4]:
print(S)

0    45
1    67
2    89
3    76
4    43
5    23
6    78
dtype: int32

In [5]:
#to check datatype of each element 
S.dtype

dtype('int32')

In [6]:
#to show first 5 records from Series : - 
#1. use slicing [0:5:1]

#or 2. head() inbuilt method of pandas library : to show first 5 record
#use slicing :
S[:5] #start =0 th index , stop=5-1=4th index step=+1 by default

0    45
1    67
2    89
3    76
4    43
dtype: int32

In [7]:
#or head()
S.head()

0    45
1    67
2    89
3    76
4    43
dtype: int32

In [8]:
#to show first 3 records 
S.head(3) #S[:3]

0    45
1    67
2    89
dtype: int32

In [9]:
#To show last 5 records, use slicing or tail()
S[-5:]

2    89
3    76
4    43
5    23
6    78
dtype: int32

In [10]:
S.tail()

2    89
3    76
4    43
5    23
6    78
dtype: int32

In [11]:
#sample() : to extract data randomly , by default 1 record 
S.sample() #by default only 1 random record

1    67
dtype: int32

In [12]:
#to show any 5 records randomly from Series S
S.sample(5)

5    23
0    45
4    43
2    89
6    78
dtype: int32

In [13]:
S

0    45
1    67
2    89
3    76
4    43
5    23
6    78
dtype: int32

In [14]:
#Access data from multiple index , create list of indexing
#suppose extract data at 1st index , 4th index and 6th index
S[[1,4,6]]

1    67
4    43
6    78
dtype: int32

In [15]:
S

0    45
1    67
2    89
3    76
4    43
5    23
6    78
dtype: int32

In [16]:
#create a Series with the help of List and user define index 
L=[34,56,78,90,34,20,45] #value
I=['Ram','Reeta','Mohan','Kiran','Poonam','Karan','Meera']
#convert List into Series
student=pd.Series(L,index=I)
print(student)

Ram       34
Reeta     56
Mohan     78
Kiran     90
Poonam    34
Karan     20
Meera     45
dtype: int64

In [17]:
#Extract data of Reeta ,Poonam and Meera
student[['Reeta','Poonam','Meera']]

Reeta     56
Poonam    34
Meera     45
dtype: int64

In [18]:
#Access Data of Mohan to Karan
student['Mohan':'Karan']

Mohan     78
Kiran     90
Poonam    34
Karan     20
dtype: int64

In [19]:
#Create Series with the help of dictionary 
#dictionary means key:value 
#key : unique 
#create a dictionary 
dict={'name':'Seema Pandey','Age':23,'City':'Indore','Salary':45000}
print(type(dict))
print(dict)

<class 'dict'>
{'name': 'Seema Pandey', 'Age': 23, 'City': 'Indore', 'Salary': 45000}

In [20]:
#convert dictionary into Series 
student=pd.Series(dict)
print(type(student))
print(student)

<class 'pandas.core.series.Series'>
name      Seema Pandey
Age                 23
City            Indore
Salary           45000
dtype: object

In [21]:
#to check the number of rows and columns in Series student ,use inbuilt 
#attributes shape  : its return anser in tuple (no. of rows ,no. of cols)
student.shape

(4,)

In [22]:
student

name      Seema Pandey
Age                 23
City            Indore
Salary           45000
dtype: object

In [23]:
#Replace value of city with 'Pune'
student['City']='Pune'
student

name      Seema Pandey
Age                 23
City              Pune
Salary           45000
dtype: object

In [24]:
#DataFrame : second datastructure of pandas library 
#DataFrame means 2D array means to store data in the form of rows and column
#means tabular form .

In [25]:
'''A pandas DataFrame can be created using various inputs : -
1. Lists (nested list)
2. dict
3. Series
4. 2D Numpy array'''

'A pandas DataFrame can be created using various inputs : -\n1. Lists (nested list)\n2. dict\n3. Series\n4. 2D Numpy array'

In [26]:
#create a DataFrame with the help of dictionary 
dict={'name':['Seema Pandey','Renu','Pankaj','Deepak','Neelu',
    'Tina','Meera'],'Age':[23,34,19,26,35,25,29],'City':['Indore',
                'Pune','Indore','Mumbai','Nasik','Pune','Indore'],
     'Salary':[45000,34000,23000,46000,43900,32000,19000]}
print(dict)

{'name': ['Seema Pandey', 'Renu', 'Pankaj', 'Deepak', 'Neelu', 'Tina', 'Meera'], 'Age': [23, 34, 19, 26, 35, 25, 29], 'City': ['Indore', 'Pune', 'Indore', 'Mumbai', 'Nasik', 'Pune', 'Indore'], 'Salary': [45000, 34000, 23000, 46000, 43900, 32000, 19000]}

In [27]:
#convert dictionary into DataFrame 
Employee=pd.DataFrame(dict)
print(type(Employee))

print()
print(Employee)

<class 'pandas.core.frame.DataFrame'>

           name  Age    City  Salary
0  Seema Pandey   23  Indore   45000
1          Renu   34    Pune   34000
2        Pankaj   19  Indore   23000
3        Deepak   26  Mumbai   46000
4         Neelu   35   Nasik   43900
5          Tina   25    Pune   32000
6         Meera   29  Indore   19000

In [28]:
#How many rows and columns in given dataframe
Employee.shape

(7, 4)

In [29]:
#to show complete details of dataframe Employee , use inbuilt method info()
Employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   Age     7 non-null      int64
 2   City    7 non-null      object
 3   Salary  7 non-null      int64
dtypes: int64(2), object(2)
memory usage: 356.0+ bytes

In [30]:
#to show datatype of name column only
Employee['name'].dtype
# 'O' means object type

dtype('O')

In [31]:
#To show first 5 records 
Employee.head()

           name  Age    City  Salary
0  Seema Pandey   23  Indore   45000
1          Renu   34    Pune   34000
2        Pankaj   19  Indore   23000
3        Deepak   26  Mumbai   46000
4         Neelu   35   Nasik   43900

In [32]:
#To show last 5 records
Employee.tail()

     name  Age    City  Salary
2  Pankaj   19  Indore   23000
3  Deepak   26  Mumbai   46000
4   Neelu   35   Nasik   43900
5    Tina   25    Pune   32000
6   Meera   29  Indore   19000

In [33]:
#To show those records whose salary >30000
#SQL fire : -  select * from Employee where Salary>30000
#in Pandas : -  dataframename[condition]
Employee[Employee['Salary']>30000]

           name  Age    City  Salary
0  Seema Pandey   23  Indore   45000
1          Renu   34    Pune   34000
3        Deepak   26  Mumbai   46000
4         Neelu   35   Nasik   43900
5          Tina   25    Pune   32000

In [34]:
#To show those records whose salary >30000 and City='Pune'
#SQL fire : -  select * from Employee where Salary>30000 and Citu='Pune'
#in Pandas : -  dataframename[condition]
Employee[(Employee['Salary']>30000)&(Employee['City']=='Pune')]

   name  Age  City  Salary
1  Renu   34  Pune   34000
5  Tina   25  Pune   32000

In [35]:
#create a DataFrame with the help of dictionary 
dict={'name':['Seema Pandey','Renu','Pankaj','Deepak','Neelu',
    'Tina','Meera'],'Age':[23,34,19,26,35,25,29],'City':['Indore',
                'Pune','Indore','Mumbai','Nasik','Pune','Indore'],
     'Salary':[45000,34000,23000,46000,43900,32000,19000]}
#print(dict)

#convert dictionary into dataframe
student=pd.DataFrame(dict)
student

           name  Age    City  Salary
0  Seema Pandey   23  Indore   45000
1          Renu   34    Pune   34000
2        Pankaj   19  Indore   23000
3        Deepak   26  Mumbai   46000
4         Neelu   35   Nasik   43900
5          Tina   25    Pune   32000
6         Meera   29  Indore   19000

In [36]:
#Access data Through Indexing 
#Access Age of all students 
student['Age']

0    23
1    34
2    19
3    26
4    35
5    25
6    29
Name: Age, dtype: int64

In [37]:
#Access multiple column of all rows
#extract Age and Salary of all students
student[['Age','Salary']]

   Age  Salary
0   23   45000
1   34   34000
2   19   23000
3   26   46000
4   35   43900
5   25   32000
6   29   19000

In [38]:
student

           name  Age    City  Salary
0  Seema Pandey   23  Indore   45000
1          Renu   34    Pune   34000
2        Pankaj   19  Indore   23000
3        Deepak   26  Mumbai   46000
4         Neelu   35   Nasik   43900
5          Tina   25    Pune   32000
6         Meera   29  Indore   19000

In [39]:
#Access all rows from Name to City
#student['name':'City'] #raise error

In [40]:
#To access all details of 3rd row-index 
#student[2] #raise error
#We want to retrieve value of particular rowindex then use inbuilt command
#iloc means index location  dataframename.iloc[rowindex]
student.iloc[3]

name      Deepak
Age           26
City      Mumbai
Salary     46000
Name: 3, dtype: object

In [41]:
#access all details of 2 to 4th row index
student.iloc[2:5]

     name  Age    City  Salary
2  Pankaj   19  Indore   23000
3  Deepak   26  Mumbai   46000
4   Neelu   35   Nasik   43900

In [42]:
#Access City of 3rd row index 
#student.iloc[3,'city']#raise error
student.iloc[3,2] #here 3 row index and 2 col index

'Mumbai'

In [43]:
#Access City of 3rd row index  
student.loc[3,'City']

'Mumbai'

In [44]:
#or dataframename[colname][rowindex]
student['City'][3]

'Mumbai'

In [45]:
student

           name  Age    City  Salary
0  Seema Pandey   23  Indore   45000
1          Renu   34    Pune   34000
2        Pankaj   19  Indore   23000
3        Deepak   26  Mumbai   46000
4         Neelu   35   Nasik   43900
5          Tina   25    Pune   32000
6         Meera   29  Indore   19000

In [46]:
#Access last column of all students(all rows)
student.iloc[:,-1]

0    45000
1    34000
2    23000
3    46000
4    43900
5    32000
6    19000
Name: Salary, dtype: int64

In [47]:
#pandas : 
#Extracting the Data from various sources : -
#1. Clipboard : -clipboard is a temporary memory of system .
#read_clipboard()  : inbuilt method of pandas library : to read data from 
#clipboad but data hold in clipboard in tabular form
#clipboard hold only current data 
import pandas as pd

In [48]:
#To read data from clipboard and hold in object of DataFrame 
df=pd.read_clipboard()
df

    Year       IPL Winners List                    Runner up         Venue
0   2008       Rajasthan Royals          Chennai Super Kings        Mumbai
1   2009        Deccan Chargers  Royal Challengers Bangalore  Johannesburg
2   2010    Chennai Super Kings               Mumbai Indians        Mumbai
3   2011    Chennai Super Kings  Royal Challengers Bangalore       Chennai
4   2012  Kolkata Knight Riders          Chennai Super Kings       Chennai
5   2013         Mumbai Indians          Chennai Super Kings       Kolkata
6   2014  Kolkata Knight Riders              Kings XI Punjab     Bangalore
7   2015         Mumbai Indians          Chennai Super Kings       Kolkata
8   2016    Sunrisers Hyderabad  Royal Challengers Bangalore     Bangalore
9   2017         Mumbai Indians      Rising Pune Supergiants     Hyderabad
10  2018    Chennai Super Kings          Sunrisers Hyderabad        Mumbai
11  2019         Mumbai Indians          Chennai Super Kings     Hyderabad
12  2020         Mumbai Indians               Delhi Capitals         Dubai
13  2021    Chennai Super Kings        Kolkata Knight Riders         Dubai
14  2022        Gujarat Titians             Rajasthan Royals     Ahmedabad
15  2023    Chennai Super Kings              Gujarat Titians     Ahmedabad
16  2024            Not Decided                  Not Decided   Not Decided

In [49]:
import os
os.getcwd()

'C:\\Users\\Lenovo'

In [50]:
df.to_csv('IPL_match.csv',index=False)
#dataframename.to_csv('permanent file.csv',index=False)
#to save data from object of dataframe to csv file
#csv means comma separated values

In [51]:
#Read data from csv file and hold data in object of dataframe
#use inbuilt method read_csv('permanent exist file.csv')
df=pd.read_csv('IPL_match.csv')

df

In [52]:
#to show no. of rows and no. of columns
df.shape

(17, 4)

In [53]:
#To show datatype of each column
df.dtypes 
#here object means string

Year                 int64
IPL Winners List    object
Runner up           object
Venue               object
dtype: object

In [54]:
#to show first 5 records from given dataframe
df.head()

   Year       IPL Winners List                    Runner up         Venue
0  2008       Rajasthan Royals          Chennai Super Kings        Mumbai
1  2009        Deccan Chargers  Royal Challengers Bangalore  Johannesburg
2  2010    Chennai Super Kings               Mumbai Indians        Mumbai
3  2011    Chennai Super Kings  Royal Challengers Bangalore       Chennai
4  2012  Kolkata Knight Riders          Chennai Super Kings       Chennai

In [55]:
#to show last 5 records from given dataframe
df.tail()

    Year     IPL Winners List              Runner up        Venue
12  2020       Mumbai Indians         Delhi Capitals        Dubai
13  2021  Chennai Super Kings  Kolkata Knight Riders        Dubai
14  2022      Gujarat Titians       Rajasthan Royals    Ahmedabad
15  2023  Chennai Super Kings        Gujarat Titians    Ahmedabad
16  2024          Not Decided            Not Decided  Not Decided

In [56]:
#to show randomly 5 records 
df.sample(5)

    Year       IPL Winners List                Runner up      Venue
12  2020         Mumbai Indians           Delhi Capitals      Dubai
4   2012  Kolkata Knight Riders      Chennai Super Kings    Chennai
9   2017         Mumbai Indians  Rising Pune Supergiants  Hyderabad
7   2015         Mumbai Indians      Chennai Super Kings    Kolkata
14  2022        Gujarat Titians         Rajasthan Royals  Ahmedabad

In [57]:
#To show list of column name in given dataframe
print(df.columns)

Index(['Year', 'IPL Winners List', 'Runner up', 'Venue'], dtype='object')

In [58]:
#to show completer details of given dataframe 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Year              17 non-null     int64
 1   IPL Winners List  17 non-null     object
 2   Runner up         17 non-null     object
 3   Venue             17 non-null     object
dtypes: int64(1), object(3)
memory usage: 676.0+ bytes

In [59]:
#check null values NaN in each columns
df.isnull()  #return answer True/False

     Year  IPL Winners List  Runner up  Venue
0   False             False      False  False
1   False             False      False  False
2   False             False      False  False
3   False             False      False  False
4   False             False      False  False
5   False             False      False  False
6   False             False      False  False
7   False             False      False  False
8   False             False      False  False
9   False             False      False  False
10  False             False      False  False
11  False             False      False  False
12  False             False      False  False
13  False             False      False  False
14  False             False      False  False
15  False             False      False  False
16  False             False      False  False

In [60]:
#count the null values in each column from given dataframe
df.isnull().sum()

Year                0
IPL Winners List    0
Runner up           0
Venue               0
dtype: int64

In [61]:
df

    Year       IPL Winners List                    Runner up         Venue
0   2008       Rajasthan Royals          Chennai Super Kings        Mumbai
1   2009        Deccan Chargers  Royal Challengers Bangalore  Johannesburg
2   2010    Chennai Super Kings               Mumbai Indians        Mumbai
3   2011    Chennai Super Kings  Royal Challengers Bangalore       Chennai
4   2012  Kolkata Knight Riders          Chennai Super Kings       Chennai
5   2013         Mumbai Indians          Chennai Super Kings       Kolkata
6   2014  Kolkata Knight Riders              Kings XI Punjab     Bangalore
7   2015         Mumbai Indians          Chennai Super Kings       Kolkata
8   2016    Sunrisers Hyderabad  Royal Challengers Bangalore     Bangalore
9   2017         Mumbai Indians      Rising Pune Supergiants     Hyderabad
10  2018    Chennai Super Kings          Sunrisers Hyderabad        Mumbai
11  2019         Mumbai Indians          Chennai Super Kings     Hyderabad
12  2020         Mumbai Indians               Delhi Capitals         Dubai
13  2021    Chennai Super Kings        Kolkata Knight Riders         Dubai
14  2022        Gujarat Titians             Rajasthan Royals     Ahmedabad
15  2023    Chennai Super Kings              Gujarat Titians     Ahmedabad
16  2024            Not Decided                  Not Decided   Not Decided

In [62]:
#To show Winner columns of all rows 
df['Winner']

KeyError: 'Winner'

In [ ]:
#to show the list of winner team (duplicates not allowed)
#in SQL : select distinct Winner from df
#in pandas :  unique() 
df['Winner'].unique()

In [ ]:
#How many times to won the match each team 
#SQL :  select count(*),Winner from df group by Winner
#in Pandas : use value_counts()
df['Winner'].value_counts()

In [ ]:
df

In [ ]:
#To show those records whose Winner team=Mumbai Indians
df[df['Winner']=='Mumbai Indians']

In [ ]:
#To show those records whose Winner team=Mumbai Indians and Venue=
#Hyderabad 
df[(df['Winner']=='Mumbai Indians')&(df['Venue']=='Hyderabad')]

In [ ]:
#Data Extract from diffrent sources 
#1. from clipboard
#2. from csv file

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#To load csv file  and hold in object of dataframe
car=pd.read_csv('Automobile_data.csv')

In [ ]:
#to show first 5 records
#car.head(3)
#to show any 10 records
car.sample(10)

In [ ]:
#how many rows and columns
car.shape

In [ ]:
#To check datatypes of each column
car.dtypes

In [ ]:
#to show complete details of given dataset
car.info()

In [ ]:
#check null values in given dataset 
car.isnull().sum()

In [ ]:
#suppose create a dataframe with the help of dictionary 
d={'name':['anu','deepak','ritu','kiran'],
  'Age':[23,np.nan,39,32],'Math':[np.nan,89,np.nan,78]}
print(d)

In [ ]:
#Convert dictionary d into dataframe
df=pd.DataFrame(d)
df

In [ ]:
df.dtypes

In [ ]:
#To check null values in given dataset df
df.isnull().sum()

In [ ]:
#!pip install matplotlib
#!pip install seaborn

In [ ]:
import seaborn as sb

In [ ]:
#To show null values in visualisation form
sb.heatmap(df.isnull())

In [ ]:
#to fill null values with mean of Math and Age column
#df['Age'].fillna(df['Age'].mean()) #but fill temporary
#fill permanent , use inplace=True
df['Age'].fillna(df['Age'].mean(),inplace=True)
df['Math'].fillna(df['Math'].mean(),inplace=True)

In [ ]:
df

In [ ]:
#to check null values
df.isnull().sum()

In [ ]:
#show visualize form
sb.heatmap(df.isnull())

In [ ]:
car.head()

In [ ]:
#visulaize null value in car dataset
sb.heatmap(car.isnull())

In [ ]:
car.head()

In [ ]:
#check category of fuel-type 
car['fuel-type'].unique()

In [ ]:
#How many gas car and diesel car , use value_counts()
car['fuel-type'].value_counts()

In [ ]:
import seaborn as sb
import matplotlib.pyplot as plt

In [ ]:
#show how many gas and diesel car in visualize form
sb.countplot(data=car,x='fuel-type')
f=car['fuel-type'].value_counts() #find the frequency
plt.yticks(f)
plt.show()

In [ ]:
car.head()

In [ ]:
#How many type of manufacturing car in car dataset
car['make'].unique()

In [ ]:
car['make'].value_counts()

In [ ]:
#to find the total sum of price of car according to make
#use groupby() inbuilt function
car.groupby('make')['price'].sum()

In [ ]:
#to find the average of price of car according to make
car.groupby('make')['price'].mean()
#max()  ,min()

In [ ]:
car[car['make']=='alfa-romero']['price'].sum()
#car[condition]

In [ ]:
car.head()

In [ ]:
car.groupby(['make','fuel-type'])['price'].count()

In [ ]:
#merge() : to join 2 or more dataframe and hold in new dataframe 
#create first dictionary 
dict1={'rno':[101,102,103,106,107],'math':[56,67,78,90,76]}
#convert dict1 into dataframe
df1=pd.DataFrame(dict1)
df1

In [ ]:
#create a dictionary
dict2={'rno':[101,103,104,105,107,108],'science':[67,89,76,54,67,90]}
#convert dictionary dict2 into dataframe
df2=pd.DataFrame(dict2)
df2

In [ ]:
#merge means join both dataframe df1 and df2 on common column rno and 
#hold merge data in new dataframe df3
df3=pd.merge(df1,df2,on='rno') #Equal or inner or natural join
#pd.merge(dataframe1,dataframe2,.., on="common column")
df3

In [ ]:
#outer join
df3=pd.merge(df1,df2,on='rno',how='outer') #bydefault how='inner'
df3

In [ ]:
#append() : 
#create a dictionary 
d1={'rno':[101,103,106],'name':['anu','deepak','binu'],'math':[34,56,78]}
#convert dictionary into dataframe
df1=pd.DataFrame(d1)
df1

In [ ]:
#create a dictionary 
d2={'rno':[102,105,104,107],'name':['kiran','deepak','renu','kamal'],
    'math':[34,56,78,60]}
#convert dictionary into dataframe
df2=pd.DataFrame(d2)
df2

In [ ]:
import warnings 
warnings.filterwarnings('ignore')
#append
df3=df1.append(df2)
df3

In [ ]:
#append
df3=df1.append(df2,ignore_index=True) #by default ignore_index=False
df3

In [ ]:
df3.sort_values('name') #by deafult ascending order but temporary
#dataframename.sort_values('column name')
#sort means to arranged record in ascending or descending order

In [ ]:
#descending order according to name column if dataframe df3 
df4=df3.sort_values('name',ascending=False,ignore_index=True) 
#by default ascending=True

In [ ]:
df4